tap "oven-sh/bun"
brew "chezmoi"
brew "colima"
brew "docker"
brew "docker-compose"
brew "exercism"
brew "eza"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "goenv"
brew "golang-migrate"
brew "kubernetes-cli"
brew "neovim"
brew "peco"
brew "pmtiles"
brew "protobuf"
brew "rustup"
brew "specify"
brew "starship"
brew "uv"
brew "volta"
brew "yamllint"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "claude-code"
cask "codex"
cask "ghostty"
cask "orbstack"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "christian-kohler.path-intellisense"
vscode "coderabbit.coderabbit-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot-chat"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hediet.vscode-drawio"
vscode "leetcode.vscode-leetcode"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
cargo "workshop-runner"
