tap "oven-sh/bun"
brew "chezmoi"
brew "colima"
brew "docker"
brew "docker-compose"
brew "eza"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "golang-migrate"
brew "kubernetes-cli"
brew "neovim"
brew "peco"
brew "pmtiles"
brew "protobuf"
brew "rustup"
brew "starship"
brew "uv"
brew "volta"
brew "yamllint"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
brew "oven-sh/bun/bun"
cask "claude-code"
cask "codex"
cask "ghostty"
cask "orbstack"
vscode "3w36zj6.textlint"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "christian-kohler.path-intellisense"
vscode "coderabbit.coderabbit-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "hediet.vscode-drawio"
vscode "leetcode.vscode-leetcode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "openai.chatgpt"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "streetsidesoftware.code-spell-checker"
vscode "taiyofujii.novel-writer"
